---
kind: method
id: M:Autodesk.Revit.DB.TransmissionData.GetAllExternalFileReferenceIds
source: html/7df7afd5-8c73-30d9-0f01-0690a3861d1f.htm
---
# Autodesk.Revit.DB.TransmissionData.GetAllExternalFileReferenceIds Method

Gets the ids of all ExternalFileReferences.

## Syntax (C#)
```csharp
public ICollection<ElementId> GetAllExternalFileReferenceIds()
```

## Returns
The ids of all ExternalFileReferences.